# Introduction rapide

Voici un premier exercice simple mais complet pour montrer comment :
- créer une base de données SQLite
- créer un tableau de données
- insérer des données dans la table
- interroger les données de la table

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Création d'une base de données SQLite

Il est conseillé de créer votre propre base de données, de sorte que vous soyez libre d'effectuer toutes les opérations sur celle-ci. 

Si vous utilisez le shell SQLite, nous pouvons appliquer la commande *** open *** à la fois pour créer une base de données SQLite ou pour l'ouvrir au cas où elle existe déjà, comme:

> sqlite> .open testdb

De même, nous pouvons utiliser ipython-sql pour la même chose:

In [6]:
%sql sqlite:////content/writers.db3

u'Connected: @/content/writers.db3'

### Création d'une table

***%%sql*** permet d'effectuer plusieurs instructions SQL dans une seule cellule du notebook.

Nous allons créer la table à l'aide d'une commande SQL standard : **CREATE TABLE**

Si la table existe déjà dans la base de données, une erreur sera retournée. 

De plus, nous avons défini ***PRIMARY KEY*** sur le champ USERID pour éviter d'insérer des auteurs en double dans la table.

In [7]:
%%sql sqlite://
CREATE TABLE writer(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,  
    USERID int  NOT NULL UNIQUE, 
    PRIMARY KEY (USERID)
);

Done.

[]

### Ajout de données dans la table

La table que nous venons de créer est vide. 

Nous allons donc insérer des données à l'intérieur. 

Pour renseigner ces données sous forme de lignes, nous utiliserons la commande **INSERT**

In [8]:
%%sql sqlite://
INSERT INTO writer VALUES ('William', 'Shakespeare', 1616);
INSERT INTO writer VALUES ('Lin', 'Han', 1996);
INSERT INTO writer VALUES ('Peter', 'Brecht', 1978);

1 rows affected.
1 rows affected.
1 rows affected.

[]

### Exécution de notre 1ère requête

Nous allons écrire une requête simple pour vérifier les résultats des opérations précédentes dans lesquelles nous avons créé une table et y avons inséré trois lignes de données. 

Pour cela, nous utiliserons la commande appelée **SELECT**

nous pouvons mettre le résultat de la requête dans une variable nommée **sqlres** dans l'exemple suivant :

In [9]:
sqlres = %sql SELECT * from writer
sqlres

 * sqlite:////content/writers.db3
Done.

[(u'William', u'Shakespeare', 1616),
 (u'Lin', u'Han', 1996),
 (u'Peter', u'Brecht', 1978)]

Vous pouvez également sélectionner des colonnes spécifiques, en spécifiant leurs noms :

In [10]:
sqlres = %sql SELECT FirstName, LastName from writer
sqlres

 * sqlite:////content/writers.db3
Done.

[(u'William', u'Shakespeare'), (u'Lin', u'Han'), (u'Peter', u'Brecht')]